//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Через строку решать нельзя.
//456 -> 5

int num =456;
Console.WriteLine($"Вторая цифра в числе {num}, будет {(num/10)%10}");



//782 -> 8

// int num = 782;
// Console.WriteLine($"Вторая цифра в числе {num}, будет {(num/10)%10}");



//918 -> 1

// int num = 918;
// Console.WriteLine($"Вторая цифра в числе {num}, будет {(num/10)%10}");